; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 348604 2 1 2 6 2
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	infrared0 - mode
	image1 - mode
	GroundStation0 - direction
	GroundStation1 - direction
	GroundStation3 - direction
	GroundStation5 - direction
	GroundStation2 - direction
	Star4 - direction
	Planet6 - direction
	Phenomenon7 - direction
)
(:init
	(supports instrument0 infrared0)
	(supports instrument0 image1)
	(calibration_target instrument0 Star4)
	(calibration_target instrument0 GroundStation2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet6)
	(supports instrument1 infrared0)
	(supports instrument1 image1)
	(calibration_target instrument1 Star4)
	(calibration_target instrument1 GroundStation2)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation1)
)
(:goal (and
	(pointing satellite1 GroundStation2)
	(have_image Planet6 image1)
	(have_image Phenomenon7 image1)
))

)

; plan
1. (turn_to satellite1 groundstation2 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 groundstation2)
   goals met: 1 of 3
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 3
3. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 1 of 3
4. (turn_to satellite0 phenomenon7 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 phenomenon7)
   goals met: 1 of 3
5. (calibrate satellite1 instrument1 groundstation2)
   added: (calibrated instrument1)
   goals met: 1 of 3
6. (turn_to satellite0 planet6 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 planet6)
   goals met: 1 of 3
7. (turn_to satellite1 phenomenon7 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 phenomenon7)
   goals met: 0 of 3
8. (turn_to satellite0 groundstation2 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 groundstation2)
   goals met: 0 of 3
9. (take_image satellite1 phenomenon7 instrument1 image1)
   added: (have_image phenomenon7 image1)
   goals met: 1 of 3
10. (calibrate satellite0 instrument0 groundstation2)
   added: (calibrated instrument0)
   goals met: 1 of 3
11. (turn_to satellite1 groundstation2 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 groundstation2)
   goals met: 2 of 3
12. (turn_to satellite0 planet6 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 planet6)
   goals met: 2 of 3
13. (take_image satellite0 planet6 instrument0 image1)
   added: (have_image planet6 image1)
   goals met: 3 of 3
